Tekla Open API Reference for Tekla Structures 2025
InputDefinition Methods
The PluginBase.InputDefinition type exposes the following members.
Methods
Name | Description
GetInput
 Returns the input Tekla Structures gave to the plug-in. The input is either a point instance, an identifier instance, an array list of points or an array list of identifiers. This is based on the input format returned from the DefineInput() method.
GetInputType
 Returns the type of the input the current instance contains.
Top
See Also
Reference
PluginBase.InputDefinition Class
Tekla.Structures.Plugins Namespace